#include <iostream>
using namespace std;
int main() {
	// 1 
	/*Необходимо вывести на экран числа от 1 до 5. На экране должно быть:
    1 2 3 4 5*/
	/*for (int = 1; i <= 5; i = i + 1) {
		cout << i << endl;
	}*/


	// 2
	/*Необходимо вывести на экран числа от 5 до 1. На экране должно быть :

	5 4 3 2 1*/
	/*for (int i = 5; i >= 1; i = i - 1) {
		cout << i << endl;1
	}*/

	//3
	/*вывести квадраты четных чисел от 0 до 10*/
	/*for (int i = 0; i <= 10; i = i + 2) {
		cout << i * i << endl;}*/

	// 4
	//найти сумму чисел от 93 до 99
	/*int sum = 0;
	for (int i = 93; i <= 99; i = i + 1)
	{
		sum = sum + i; 
	}
	cout << sum << endl;*/
		
	// 2 абрамян 
	/*Даны два целых числа A и B (A < B). Вывести в порядке возрастания все
	целые числа, расположенные между A и B (включая сами числа A и B), а
	также количество N этих чисел.*/
	/*int a, b;
	cin >> a;
	cin >> b;
	

	int i;
	for (i = a; i <= b; i = i + 1) {
		cout << i << endl;
	}*/
		
	


}